# KALYANI SHIVUNOORI
# Roll No:198

# 1. Write a program that takes a number N as input from the user and prints pascal's triangle of N height/steps.

Pascal's triangle is a triangular array constructed by summing adjacent elements in preceding rows.

For example if N = 4

     1
    1 1
   1 2 1
  1 3 3 1

In [7]:
n=int(input())
for i in range(n):
     print(" "*(4-i),end=" ")
     print(" ".join(str(11**i)))

5
     1
    1 1
   1 2 1
  1 3 3 1
 1 4 6 4 1

# 2.Write a program that keeps taking user input for password until 'Enter' key is pressed and then checks password with following validation:

At least 9 characters

Contains 1 uppercase and 1 lowercase letter at least

Contains one number at least

Contains one special character at least and it should be one of the allowed special characters [$,_, %]

If password is incorrect show related error else show a success message.

In [22]:
lower=0
upper=0
numeric=0
specialchar=['$','_',"%"]
countspecial=0
while 1:
    s=input("Enter ")
    for a in s:
        if a.islower():
            lower +=1
        if a.isupper():
            upper +=1
        if a.isnumeric():
            numeric +=1
        if a in specialchar:
            countspecial +=1
    if (lower and upper and  numeric and countspecial and len(s)>=9):
            print("success")
            break
    else:
            pass

Enter Kalyani%03
success

In [1]:
import re
while 1:
    s=input()
    pattern= r"(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[^a-zA-Z0-9]).{9,}$"
    match = re.search(pattern, s)
    if match:
        print("success")
        break
    else:
        pass

Kalyani@03
success

# 3 Create a database named "employee_management" and create following tables:

Employee: Employee id, Name, DoB, Salary, Department_id

Department: Department id, HOD Name (Note: head of department, will be one of the employees)

Use employee_management;
create table employee(Employee_id int auto_increment   primary key, name varchar(9),Dob date, salary decimal(10,2), Department_id int);
select*from Employee;
INSERT INTO Employee (Name, DoB, Salary, Department_id) VALUES 
    ('Ramya', '1980-01-01', 100000, 1),  -- HOD
    ('Jevana', '1985-01-01', 45000, 1), 
    ('Bhavya', '1990-01-01', 40000, 1), 
    ('Anitha', '1995-01-01', 35000, 1), 
    ('Manjula', '2000-01-01', 30000, 1),
    ('Ramani', '1980-01-01', 50000, 2),   -- HOD
    ('Saritha', '1985-01-01', 45000, 2), 
    ('Raju', '1990-01-01', 40000, 2), 
    ('Raames', '1995-01-01', 35000, 2), 
    ('Deepthi', '2000-01-01', 30000, 2),
    ('Gouri', '1980-01-01', 50000, 3),  -- HOD
    ('Sitha', '1985-01-01', 45000, 3), 
    ('Bhanu', '1990-01-01', 40000, 3), 
    ('Krishna', '1995-01-01', 35000, 3), 
    ('Madhu', '2000-01-01', 30000, 3),
    ('Nayna', '1985-01-01', 100000, 4),  -- HOD
    ('Varun', '1985-01-01', 45000, 4), 
    ('laxman', '1990-01-01', 40000, 4), 
    ('Vamshi', '1995-01-01', 35000, 4), 
    ('akshay', '2000-01-01', 30000, 4);
    select*from Employement;

In [5]:
import pandas as pd

df = pd.read_csv(r'E:\hope-python\employ.csv')
print(df)

    Employee_id     name         Dob    salary  Department_id
0             1    Ramya  1980-01-01  100000.0              1
1             2   Jevana  1985-01-01   45000.0              1
2             3   Bhavya  1990-01-01   40000.0              1
3             4   Anitha  1995-01-01   35000.0              1
4             5  Manjula  2000-01-01   30000.0              1
5             6   Ramani  1980-01-01   50000.0              2
6             7  Saritha  1985-01-01   45000.0              2
7             8     Raju  1990-01-01   40000.0              2
8             9   Raames  1995-01-01   35000.0              2
9            10  Deepthi  2000-01-01   30000.0              2
10           11    Gouri  1980-01-01   50000.0              3
11           12    Sitha  1985-01-01   45000.0              3
12           13    Bhanu  1990-01-01   40000.0              3
13           14  Krishna  1995-01-01   35000.0              3
14           15    Madhu  2000-01-01   30000.0              3
15           16    Nayna  1985-01-01  100000.0              4
16           17    Varun  1985-01-01   45000.0              4
17           18   laxman  1990-01-01   40000.0              4
18           19   Vamshi  1995-01-01   35000.0              4
19           20   akshay  2000-01-01   30000.0              4

# Q.1> Apply constraints on the table such that we cannot make an entry to the department table with an employee id that doesn't exist in the Employee table

  CREATE TABLE Department (
    Department_id INT AUTO_INCREMENT PRIMARY KEY,  
    HOD_id INT,                                    
    Department_name VARCHAR(50),                   
    FOREIGN KEY (HOD_id) REFERENCES Employee(Employee_id)  
);


INSERT INTO Department (HOD_id, Department_name)
VALUES
    (1, 'HR'),         -- Ramya is HOD (Employee_id 1)
    (6, 'Finance'),     -- Ramani is HOD (Employee_id 6)
    (11, 'Marketing'),  -- Gouri is HOD (Employee_id 11)
    (16, 'IT');         -- Nayna is HOD (Employee_id 16)

select*from Department;

In [9]:
import pandas as pd

df = pd.read_csv(r'E:\hope-python\department.csv')
print(df)

   Department_id  HOD_id Department_name
0              1       1              HR
1              2       6         Finance
2              3      11       Marketing
3              4      16              IT

# Q.2> Write a query to get average salary of employees grouped by their department and show along with department name

select department.department_name, avg(salary)  from employee join department on employee.department_id=department.department_id group by(department_name);

In [8]:
import pandas as pd

df = pd.read_csv(r'E:\hope-python\depavgsalary.csv')
print(df)

  department_name  avg(salary)
0              HR      50000.0
1         Finance      40000.0
2       Marketing      40000.0
3              IT      50000.0

# Q.3> Write a query to get the list of HODs whose salary is greater than average salary of HODs

SELECT e.name, d.hod_id, e.salary 
FROM Department d
JOIN Employemee e ON d.hod_id = e.employee_id
WHERE e.salary > (SELECT AVG(emp.salary) 
                  FROM Department dep 
                  JOIN Employement emp ON dep.hod_id = emp.employee_id);

In [6]:
import pandas as pd

df = pd.read_csv(r'E:\hope-python\hodsalary.csv')
print(df)

    name  hod_id    salary
0  Ramya       1  100000.0
1  Nayna      16  100000.0

# Q.4> Write a query to get the names of youngest and oldest HOD along with their age

(SELECT 
e.name AS HOD_Name, d.hod_id,TIMESTAMPDIFF(YEAR, e.dob, CURDATE()) AS Age
FROM Department d
JOIN Employee e ON d.hod_id = e.employee_id
ORDER BY Age ASC
    LIMIT 1
)
UNION ALL
(
SELECT 
e.name AS HOD_Name, d.hod_id,TIMESTAMPDIFF(YEAR, e.dob, CURDATE()) AS Age
FROM Department d
JOIN Employemee e ON d.hod_id = e.employee_id
ORDER BY Age DESC
LIMIT 1
);

In [7]:
import pandas as pd

df = pd.read_csv(r'E:\hope-python\youngold.csv')
print(df)

  HOD_Name  hod_id  Age
0    Nayna      16   39
1    Ramya       1   44

# Q.5> Write a query to get the list of departments where HODs earn at least twice the average salary of the other employees in that department.

SELECT 
    d.Department_name
FROM 
    Department d
JOIN 
    Employemee AS HOD ON d.HOD_id = HOD.Employee_id  -- Join to get HOD details
JOIN 
    Employemee AS Emp ON d.Department_id = Emp.Department_id  -- Join to get all employees in the department
GROUP BY 
    d.Department_name, HOD.salary  -- Group by department name and HOD's salary
HAVING 
    HOD.salary >= 2 * AVG(Emp.Salary);

In [10]:
import pandas as pd

df = pd.read_csv(r'E:\hope-python\hod-2avg.csv')
print(df)

  Department_name
0              HR
1              IT